7.1 处理缺失数据

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1,NA,3.5,NA,7])

In [9]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(how = 'all', axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.340714 -0.971028  0.423763
1  1.048303 -1.688895 -0.389495
2  0.094442 -0.244252  0.331487
3  0.538664  0.695668  0.971187
4 -2.482411  0.394596  0.298434
5 -0.243493 -0.776314  0.326032
6 -0.010392  1.644592  0.428901

In [24]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  1.340714       NaN       NaN
1  1.048303       NaN       NaN
2  0.094442       NaN  0.331487
3  0.538664       NaN  0.971187
4 -2.482411  0.394596  0.298434
5 -0.243493 -0.776314  0.326032
6 -0.010392  1.644592  0.428901

In [25]:
df.dropna()

          0         1         2
4 -2.482411  0.394596  0.298434
5 -0.243493 -0.776314  0.326032
6 -0.010392  1.644592  0.428901

In [34]:
df.dropna(thresh = 2)#再看一下什么意思

          0         1         2
2  0.094442       NaN  0.331487
3  0.538664       NaN  0.971187
4 -2.482411  0.394596  0.298434
5 -0.243493 -0.776314  0.326032
6 -0.010392  1.644592  0.428901

填充缺失数据

In [35]:
df.fillna(0)

          0         1         2
0  1.340714  0.000000  0.000000
1  1.048303  0.000000  0.000000
2  0.094442  0.000000  0.331487
3  0.538664  0.000000  0.971187
4 -2.482411  0.394596  0.298434
5 -0.243493 -0.776314  0.326032
6 -0.010392  1.644592  0.428901

In [37]:
df.fillna({0:0, 1:0.5, 2:0})

          0         1         2
0  1.340714  0.500000  0.000000
1  1.048303  0.500000  0.000000
2  0.094442  0.500000  0.331487
3  0.538664  0.500000  0.971187
4 -2.482411  0.394596  0.298434
5 -0.243493 -0.776314  0.326032
6 -0.010392  1.644592  0.428901

In [38]:
_ = df.fillna(0, inplace = True)

In [39]:
df

          0         1         2
0  1.340714  0.000000  0.000000
1  1.048303  0.000000  0.000000
2  0.094442  0.000000  0.331487
3  0.538664  0.000000  0.971187
4 -2.482411  0.394596  0.298434
5 -0.243493 -0.776314  0.326032
6 -0.010392  1.644592  0.428901

In [40]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -0.647770  2.509656 -1.315663
1  0.285314 -0.104844 -0.476654
2  1.259255  1.202844 -1.338130
3  0.504923  0.884353  0.066384
4 -0.101626  0.260478  0.586284
5  0.725113  1.183705  1.215772

In [41]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.647770  2.509656 -1.315663
1  0.285314 -0.104844 -0.476654
2  1.259255       NaN -1.338130
3  0.504923       NaN  0.066384
4 -0.101626       NaN       NaN
5  0.725113       NaN       NaN

In [42]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.647770  2.509656 -1.315663
1  0.285314 -0.104844 -0.476654
2  1.259255 -0.104844 -1.338130
3  0.504923 -0.104844  0.066384
4 -0.101626 -0.104844  0.066384
5  0.725113 -0.104844  0.066384

In [52]:
df.fillna(method = 'ffill', limit = 3)#limit 可以连续填充的最大数量

          0         1         2
0 -0.647770  2.509656 -1.315663
1  0.285314 -0.104844 -0.476654
2  1.259255 -0.104844 -1.338130
3  0.504923 -0.104844  0.066384
4 -0.101626 -0.104844  0.066384
5  0.725113       NaN  0.066384

In [49]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [50]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

数据转换

In [54]:
data = pd.DataFrame({'k1':['one', 'two']*3 + ['two'],
                   'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [55]:
data.duplicated()#duplicated 返回一个布尔型Series，表示各行是否重复

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [56]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [57]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [60]:
data.drop_duplicates(['k2'])#过滤掉k2列的重复行

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [61]:
data.drop_duplicates(['k1'], keep = 'last')

    k1  k2  v1
4  one   3   4
6  two   4   6

利用函数或映射进行数据转换

In [81]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'], 'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [82]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [83]:
meat_to_animal = {'bacon':'pig', 'pulled pork':'cow', 'pastrami':'cow','honey ham':'pig','nova lox': 'salmon','corned beef':'cow'}

In [84]:
lowercased = data['food'].str.lower()

In [85]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [86]:
data['animal'] = lowercased.map(meat_to_animal)

In [87]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [88]:
data['food'].map(lambda x: meat_to_animal[x.lower()])#map的方法需要再研究总结

0       pig
1       cow
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

替换值

In [89]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [90]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [91]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [92]:
data.replace([-999,-1000], [0, np.nan])

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

In [93]:
data.replace({-999: 0 , -1000: np.nan})

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

重命名轴索引

In [95]:
data = pd.DataFrame(np.arange(12).reshape(3,4), index = ['Ohio','Colorado','New York'], columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [96]:
transform = lambda x :x[:4].upper()

In [97]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [99]:
data.index = data.index.map(transform)

In [100]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [101]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [103]:
data.rename(index = {'OHIO':'INDIANA'}, columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [104]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [105]:
data.rename(index = {'OHIO':'INDIANA'}, columns = {'one':'five'}, inplace = True)

In [106]:
data

         five  two  three  four
INDIANA     0    1      2     3
COLO        4    5      6     7
NEW         8    9     10    11

离散化和面元划分

In [108]:
ages = [20,22,25,27,21,24,37,31,61,45,41,32]

In [109]:
bins = [18,25,35,60,100]

In [110]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [112]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [113]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [114]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [120]:
pd.value_counts(pd.cut(ages, [18,25,35,60,100], right = False))

[25, 35)     4
[18, 25)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [121]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged','Senior']

In [123]:
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [124]:
data = np.random.randn(20)
data

array([-0.43154254,  2.65384619, -1.62370845,  0.79106182,  0.26990325,
       -1.45110476,  2.57168282, -0.39402558, -0.34548705, -1.29776529,
        0.44064099,  0.10320733, -1.4221464 ,  0.29423661,  0.62668448,
       -2.23339539,  0.48305249, -0.69371885, -1.74445408,  0.68427651])

In [126]:
pd.value_counts(pd.cut(data, 4, precision = 2))

(0.21, 1.43]      7
(-2.24, -1.01]    6
(-1.01, 0.21]     5
(1.43, 2.65]      2
dtype: int64

In [127]:
data = np.random.randn(1000)
data

array([ 7.70826962e-01, -1.52886025e+00, -3.43023423e-01, -1.80751781e-01,
        6.63508218e-01,  3.39444631e-01,  1.22363116e+00, -8.23102300e-01,
        2.97139045e-01,  2.98915700e+00, -2.09891390e-01, -6.32522876e-01,
       -1.64516551e-01, -6.59400493e-02,  1.23943863e+00, -9.33421539e-01,
        5.73659463e-01, -4.61950094e-01, -7.41647542e-01,  1.09952340e+00,
       -7.53530243e-01,  1.51512264e-01,  1.25554732e-02,  3.88686082e-01,
       -3.50956040e-01,  1.10893868e+00, -7.41541723e-01,  8.81599272e-01,
        6.76274575e-02,  4.07479115e-01,  2.20967292e-01,  9.28580739e-01,
       -7.54211394e-01,  1.57374552e+00,  1.61641113e+00,  1.15832165e+00,
        9.44059145e-02, -4.48605494e-02, -3.93996048e-01,  4.44936355e-01,
        3.40610860e-01,  3.50105118e+00,  6.64661868e-02, -2.46346511e+00,
        1.43363238e-01, -1.85801642e+00,  2.91965762e-01,  1.46265922e+00,
       -6.51256379e-01,  4.76599064e-01, -1.14298205e+00,  1.42907490e-01,
       -5.49919509e-02, -9.16018218e-01,  2.83929691e-01, -1.16015424e+00,
       -9.42364857e-01, -4.92515054e-01,  6.46570135e-01, -1.65882982e+00,
        6.72174071e-01,  1.01636877e+00,  3.73052021e-01,  2.24166159e+00,
        8.39762666e-02,  4.33430761e-01, -1.56187172e+00, -1.31615660e+00,
        3.15894481e-01, -2.46263009e-01,  1.71613878e+00, -1.44383989e-01,
       -8.93632506e-01, -2.02874718e-01, -5.96513906e-01, -1.53015039e+00,
       -5.81223525e-01, -1.15738514e+00,  2.18611968e+00, -5.14637926e-01,
       -2.59645966e-01, -4.33025871e-01,  1.74472101e+00,  4.20213843e-01,
       -1.21826324e+00,  2.56012177e+00, -4.78718036e-02,  4.18920361e-01,
        1.81137311e+00,  4.60033088e-02,  2.11922587e+00, -1.82920272e+00,
       -7.89242778e-01,  5.03371811e-01,  9.04526455e-01,  8.51437094e-01,
        4.84361342e-01, -1.53873481e+00,  9.88464279e-02,  8.95261805e-01,
       -2.27530229e-01, -2.20641097e-01,  8.43922233e-01,  1.78537889e+00,
        3.48753050e-01,  6.91833453e-02, -7.46097047e-01,  1.00643792e+00,
        2.22971775e-01,  7.86856116e-01,  8.25574197e-01,  9.30178301e-01,
       -1.00891232e+00,  1.13470902e+00,  4.61087794e-01,  3.11590397e-01,
        6.00650046e-01, -1.15642345e+00,  5.93307817e-01, -4.63501953e-01,
       -9.91947106e-01, -2.90157546e-01,  1.31585956e+00,  2.26377194e-01,
        1.20677259e+00, -4.85587007e-01, -8.90311997e-01,  1.12420541e-01,
       -9.82098898e-01, -6.10416656e-01,  6.74355570e-01,  3.96373463e-01,
       -2.10566283e+00, -2.17703374e+00,  1.05572284e+00, -1.66966729e+00,
        1.59748709e+00,  1.49346920e+00,  3.83067594e-01,  2.48609598e-01,
        1.08207613e+00, -1.42913039e+00, -5.29291263e-01,  2.31133793e+00,
        7.05517557e-01,  9.60409388e-01, -7.82733638e-02, -1.09537028e+00,
       -9.46256123e-01,  6.86358880e-01, -1.57406212e+00, -1.19841691e+00,
       -6.98531239e-01,  5.23619829e-02,  4.92237100e-01,  1.53852145e+00,
        1.96854439e-01, -5.80424909e-01, -1.19900819e-01,  1.05714640e+00,
       -2.03323728e-01, -8.17894356e-01, -8.02224038e-01, -1.22573908e+00,
       -9.07201937e-02,  1.33379510e+00, -7.77950293e-01,  3.11868575e-01,
        6.90424900e-01, -1.06139356e+00,  1.36155138e+00,  8.32824134e-01,
        2.12790805e-01,  2.50947293e-01,  7.37166560e-01, -1.07311426e+00,
       -1.78777012e-01,  1.17094848e+00,  9.58704957e-01, -9.66501840e-01,
        3.88294354e-01, -6.55754168e-01,  1.54444663e+00,  6.41811720e-02,
       -3.12729206e-01, -3.57446976e-02, -3.48098686e-01,  1.54095705e+00,
        2.02435817e-02, -2.22644543e-01, -5.25893873e-01, -6.78741699e-01,
        9.98174004e-01,  2.23990392e+00, -2.19828526e-01,  3.15117293e+00,
       -1.51365438e+00, -1.42508042e+00, -4.50477232e-01, -3.72285455e+00,
       -1.45700670e+00, -5.60336599e-01,  2.36859470e-01, -2.46394022e-01,
        3.03298030e-01, -3.13698162e-01,  5.00592233e-02, -8.61603620e-01,
        5.26327098e-01, -5.20575044e-01, -6.82058300e-01, -1.70700121e+00,
        7.86313657e-01,  6.66651808e-01,  1.57285814e+00, -7.11157757e-01,
       -2.79907392e-01, -1.46719476e-01, -4.97524795e-01,  1.07179948e+00,
       -1.17094721e+00,  6.76497425e-01,  6.17730311e-01,  2.10980223e-01,
       -1.40754827e+00, -1.13568105e+00, -1.83103247e-01,  3.09747401e-01,
       -8.77004235e-01,  1.13903144e+00, -4.03711045e-01,  1.34218565e+00,
       -8.41190306e-01,  1.32358734e+00,  6.75502182e-01, -8.09233475e-01,
        1.40602994e-01, -1.52194399e-01,  8.82806361e-01, -1.50942003e+00,
       -4.18909708e-01,  1.60146181e-01, -6.88190306e-01, -7.95145686e-01,
        2.20782804e-01, -1.47822868e+00,  6.45787482e-01, -3.15461772e-01,
       -1.11808122e+00,  8.14165589e-02,  3.46831659e-01, -1.22393713e+00,
       -7.66405186e-01,  7.59302398e-01, -5.33661532e-01, -9.98022624e-01,
       -7.77294102e-01,  1.78338985e+00, -5.47905749e-01, -2.27427005e-01,
        1.10973116e+00,  9.09067744e-02,  3.57156148e-01, -1.71325004e+00,
        4.68761939e-01,  2.57627859e-01,  1.15941970e+00, -3.30403425e-01,
       -1.25218555e+00,  7.41240342e-02, -6.38958863e-01, -1.62677980e-01,
       -7.11377831e-01,  1.15806732e+00,  9.10106368e-01,  1.29316546e+00,
       -8.49618027e-01,  7.46630600e-01,  1.64796553e+00,  1.49020639e-01,
       -1.81219923e+00,  1.04634328e+00, -3.70266498e-02, -4.60624234e-01,
       -2.74377261e-01, -9.03118818e-01, -1.07380537e+00, -1.96289657e-01,
        8.70185434e-01,  5.87621454e-01,  1.33964398e+00,  3.38212825e-01,
        8.06551476e-01, -1.63773576e+00,  7.24631669e-01, -5.25555340e-02,
        1.80595651e-01, -4.69135753e-01,  2.52328950e-01,  4.63009947e-01,
        2.23991498e+00,  1.48247355e+00, -1.34532223e+00,  5.43383845e-01,
        1.03515939e+00,  1.42941240e+00,  7.69601945e-01,  1.44806780e+00,
       -1.04612342e+00, -9.91517197e-02, -1.55449958e-01,  1.87086866e-02,
        2.19317143e-01, -3.98698907e-01, -5.25484664e-01,  5.94100493e-01,
       -2.69622620e-01,  9.63745015e-01,  2.09065266e-01,  6.09624520e-01,
        7.49311040e-01, -1.69644693e-01,  1.33794978e+00,  1.38125324e+00,
       -1.24763022e+00,  8.95828107e-01,  3.14899843e-01,  7.20671703e-01,
        2.20210867e+00, -4.19637582e-02, -3.81786598e-01, -3.29661017e-01,
       -1.44915256e+00, -6.61516273e-01,  1.14160054e+00, -1.87212443e+00,
        1.51734674e-01, -7.19883413e-02, -2.43337935e-01, -2.00032514e-01,
       -9.17435334e-01, -1.11029877e+00,  1.16485936e+00,  7.40455651e-01,
        1.79271171e+00, -4.21866386e-01,  1.08402978e+00,  5.47569724e-02,
       -7.23472127e-01,  7.19055609e-01, -2.04802114e+00, -5.07543963e-02,
        4.11510688e-01, -3.69718094e-01,  3.68430283e-01, -3.87577647e-01,
        1.70406135e+00,  2.53718296e-01,  2.72350548e-01, -5.46502494e-01,
       -7.09167598e-01,  1.51515691e-01, -2.06610755e-01,  4.17740693e-01,
       -6.98158690e-01, -1.84294594e+00, -8.19136666e-02, -7.97328568e-01,
       -6.23564973e-01, -1.38212047e+00, -1.36601334e+00,  3.85235426e-01,
        8.82778433e-01, -4.28836101e-01, -4.54401135e-01,  1.22719308e-01,
       -1.36757784e+00, -1.09612999e+00,  3.29281854e-01, -1.18400413e+00,
       -4.49878388e-01,  6.53141173e-01,  8.31892073e-02,  1.72447625e-01,
        7.29141002e-01, -3.23391283e-01,  1.95533240e-01, -1.74960478e+00,
       -4.66460343e-02, -7.37690201e-01,  1.01714675e+00,  1.31382358e-01,
        7.81291247e-01,  8.75090064e-01,  3.40244805e-01, -8.15385908e-01,
        1.17611639e+00,  1.99572801e+00, -1.98395150e+00,  7.91438988e-01,
       -4.22390118e-01,  1.10076060e+00, -8.56618952e-01,  1.71429587e+00,
        3.34805075e-01, -1.20378343e-01,  4.94184511e-01,  9.07413132e-01,
        8.03375113e-01, -4.67126413e-01,  1.29434908e+00,  1.35612326e+00,
       -6.09653544e-01,  5.09377011e-01, -2.90673937e-01, -1.82469786e-01,
       -1.24649433e+00, -1.67734985e-01,  1.58580503e+00,  2.58578159e-01,
        6.80857613e-01,  9.30983854e-01, -5.75989180e-01, -1.60454407e-01,
       -8.80443623e-01, -1.74724748e+00,  1.03028708e+00,  6.07519776e-01,
       -9.78516805e-01,  8.61058488e-01,  1.00952923e+00,  2.13955191e-01,
        2.65340013e-01, -1.22480989e+00, -1.80377121e-02,  1.64548814e+00,
        3.16215405e-01,  6.98126380e-01,  3.50797381e-01, -2.79342761e-01,
       -4.87997554e-02,  1.86380768e+00, -8.74099286e-01,  4.16256744e-01,
        5.72215748e-01, -1.66805009e+00, -6.52346333e-01,  7.71430730e-01,
        2.77912241e-01,  7.85157496e-02,  1.31028157e+00,  1.21478172e+00,
        2.23463099e-01,  7.44094360e-01,  2.79625617e-02,  9.73808723e-01,
        2.14931572e-01,  3.41694602e-01,  8.97989611e-01,  2.81383878e-01,
       -4.56610141e-01, -4.93807173e-01, -9.64046423e-01, -9.88843135e-01,
       -2.17817660e-01, -1.09872428e+00,  6.41775303e-01,  6.61561001e-01,
       -6.49658025e-01, -2.48469283e-01, -5.56675982e-01,  7.24436885e-01,
       -7.08645079e-01, -8.39718220e-02, -1.91094898e+00, -2.11604248e-02,
        1.71781897e+00,  1.69670620e+00,  1.93705069e+00, -1.45887106e+00,
       -1.30263140e-01,  1.29054026e+00,  1.55579127e+00,  1.91254890e+00,
       -1.13343674e+00,  8.85327253e-01,  9.08367491e-01, -1.22534025e+00,
        4.05586339e-01, -1.07924438e+00,  6.54973221e-01, -5.92130214e-01,
        1.56409103e+00, -5.23187589e-01, -2.00695743e+00, -6.63991738e-01,
        8.38805105e-01,  9.69165072e-01,  4.52594858e-01, -5.35581878e-01,
        1.14389834e+00,  1.06524430e+00,  9.72103767e-01, -1.28972716e+00,
       -1.18045149e+00, -1.90114665e-01, -7.27695030e-01,  6.07470037e-02,
       -5.43787981e-01, -7.85289810e-01,  6.90579307e-01,  1.20771589e+00,
        1.34830755e+00, -1.25832742e+00, -8.31644558e-01,  1.84685986e-02,
        1.29001073e-01, -4.69781572e-01, -1.97581105e+00, -2.28538926e+00,
        4.69079565e-01,  2.77786891e-01, -1.07230408e+00, -6.07902020e-01,
       -4.48041279e-01,  6.90606846e-01,  2.13528804e-01, -2.24929878e+00,
        7.62821255e-01, -2.50036025e+00, -2.56203026e-01,  6.36211363e-01,
       -7.99442005e-01,  1.02938685e+00,  2.34134768e-01,  2.15613769e+00,
        6.89907685e-01, -1.42371213e+00, -2.22131491e+00, -1.42950520e+00,
       -3.40397282e-01,  1.20356051e-01, -1.14325747e+00, -6.93328682e-01,
        1.38291858e-01, -1.24507190e-01,  4.86277232e-01,  6.63080303e-01,
        9.30661715e-01, -1.92408785e+00,  1.82858373e+00, -1.12247610e+00,
       -3.09989627e-01,  1.75329784e-01,  3.59598928e-02,  5.39488129e-01,
       -2.76379523e+00,  5.39766904e-01,  9.58635118e-01,  4.62330181e-01,
        9.07900272e-01,  4.35482799e-01,  1.18084978e+00,  1.60648565e+00,
        2.54695814e+00, -1.13477028e+00,  1.26518519e+00,  6.28072668e-01,
        5.42652371e-01, -6.59378121e-01,  2.28110495e-01, -1.16647270e+00,
       -1.38052290e+00, -1.45620131e+00,  1.25947490e+00, -7.02725704e-01,
       -2.37128481e+00,  6.14573792e-01,  3.29312940e-01, -1.04458597e+00,
        1.21128338e+00,  4.25187815e-01, -1.29812225e-01, -1.16895403e+00,
       -1.92322141e+00,  1.07937894e-01, -1.68457792e-02,  1.73048564e-01,
       -9.15514010e-01, -5.07704220e-01,  1.30673226e-01, -1.25169876e+00,
       -1.99453268e+00, -1.03974635e-01, -1.81118368e+00,  7.94049170e-01,
       -4.57844216e-01,  2.23538863e-01, -1.71946435e+00, -4.18612364e-01,
       -1.25199451e+00,  2.26947357e+00,  9.99102086e-01,  1.13833205e-01,
        1.28520777e+00, -1.98128965e+00, -1.43899974e+00,  8.22543954e-01,
        1.20271519e+00,  2.10662246e+00,  6.59240795e-01,  7.66057593e-01,
        7.24434452e-01,  3.88515299e-01,  1.22429773e+00,  8.13981875e-01,
        2.54162766e-01,  7.22365123e-01, -1.00560373e+00, -5.16957290e-01,
       -1.70646008e+00, -3.56682885e-01,  1.04790571e+00, -3.21252805e-02,
       -1.00816169e+00,  1.22272449e+00,  3.11600068e-01,  2.65746443e-01,
        2.30758107e-01, -9.19364566e-02, -3.27521113e-01,  6.62215568e-01,
       -1.02752247e+00,  9.99084661e-01,  1.28946897e+00,  1.24747445e+00,
        2.13385832e+00, -3.70191287e-01, -1.39416790e-01,  5.01578295e-01,
        3.31347699e-02, -1.07464973e+00,  7.20100637e-02,  1.11130651e+00,
       -6.58890321e-01, -7.76850907e-01, -1.72285720e+00,  1.93862817e+00,
        1.23854746e+00,  1.18746273e+00,  3.03148265e-01, -3.26938860e-01,
       -1.69668133e+00, -4.64652484e-01,  2.81237248e-01,  4.07449577e-02,
        5.48822656e-01,  5.03880563e-01,  1.07437875e-01, -8.47323507e-01,
        1.78663869e+00,  8.92216394e-01, -1.81260559e-01, -1.33877636e+00,
        7.85590852e-02, -1.41050649e+00,  4.48012817e-01,  8.34993940e-01,
       -1.77546715e+00, -7.80401005e-01,  2.16220332e+00, -4.46184279e-01,
       -1.20147434e+00,  1.02462766e+00, -1.95780315e+00, -1.00619311e-01,
       -3.44642455e-02,  6.11210681e-01, -1.10458804e-01, -1.04942375e+00,
        4.33563629e-01, -6.08162321e-01,  1.50843371e-02, -9.52876070e-01,
       -6.38328514e-01, -1.52168671e+00, -5.33052093e-01, -8.83906474e-01,
        1.41759564e-01,  6.72306591e-01, -1.04209366e+00,  8.67635956e-01,
        2.35196031e-01,  1.70255055e+00, -2.22449761e-01, -3.67808238e-01,
       -4.53249162e-01, -4.67420535e-02,  1.01138551e+00, -2.23396599e-02,
       -3.99487468e-01, -1.99399607e-01, -7.31424843e-02, -3.09209257e-01,
        3.90804355e-01, -1.81419841e+00, -1.39195190e+00, -3.28888581e-01,
       -1.03328693e+00, -6.33484853e-01, -7.51313133e-01, -3.53830736e-01,
        1.46885670e+00, -1.87211107e+00, -1.78458818e-01,  7.17209127e-01,
        4.77803774e-01,  2.91437449e-01, -1.08939248e+00,  2.16862578e+00,
       -6.66006304e-01, -7.53869871e-01, -1.39967636e-01, -4.38558333e-01,
       -1.32981444e+00, -2.83522855e-01, -6.98680545e-01, -3.37198358e-01,
        1.22906681e+00,  1.21339989e+00, -1.32205305e-01,  2.24441733e+00,
       -7.76714570e-01,  7.93865261e-02, -4.58762375e-01,  8.32665851e-01,
       -1.47204127e-01,  4.93937815e-01, -4.58047726e-01,  5.32135818e-01,
       -9.79987742e-01,  1.10365529e+00,  1.66765849e+00, -2.10257620e-01,
       -1.43107418e+00,  1.47112660e+00, -3.72047303e-01, -8.33903405e-01,
       -2.34167934e+00,  2.00216172e+00,  1.70636842e+00, -4.46238834e-01,
       -7.56895103e-02,  1.01193287e+00,  2.18477580e+00, -2.44165244e+00,
       -2.93176868e-01, -8.84564049e-01, -9.03098809e-01, -2.27142024e+00,
       -2.83909567e-01,  8.11890212e-01,  1.34166755e-01, -5.65975136e-01,
        8.70600524e-01, -6.15253630e-01,  7.99465179e-01, -8.67844330e-01,
       -1.27468651e+00,  7.59477730e-01, -1.38351671e-01, -8.59813554e-01,
        2.36575475e+00, -1.39046240e+00,  8.64779714e-01, -2.79598820e-01,
       -4.27546860e-01, -8.63298066e-03,  1.21373317e-01,  4.78627666e-01,
        1.18394075e-01, -1.51966885e+00, -2.21391000e-01,  2.47133011e+00,
        1.01033898e-01,  7.95804080e-01, -1.30808466e+00, -1.09497373e+00,
       -1.30283360e+00,  1.81516717e+00,  8.84031906e-01,  1.89255074e+00,
       -4.09171906e-01, -6.75967010e-01, -1.58282924e+00, -6.08680812e-01,
       -2.95218651e-01,  4.48459629e-01,  1.49750487e+00, -5.82203542e-01,
        3.89853474e-01, -8.74493536e-02,  6.50519283e-01, -3.53832646e-01,
        1.19027049e+00, -9.27332736e-01, -2.76296340e+00,  1.11873473e+00,
        2.96905595e-01, -3.46436700e-01,  8.74842019e-01, -7.08889033e-01,
        1.75301469e-02, -6.31800635e-02,  8.65507961e-01,  5.64478345e-01,
        1.09699163e+00,  6.78471536e-02, -2.16297562e-01, -5.35614552e-01,
        3.00327222e-01, -6.98172853e-01, -8.07207930e-01,  6.84000285e-01,
        1.22216943e+00,  1.31957401e+00,  1.14626051e+00,  2.09634118e-01,
       -6.58480871e-01,  1.11878571e+00,  1.79401716e+00,  7.59982636e-01,
       -4.74832088e-02, -5.52204716e-01,  7.33694209e-01, -6.17122839e-01,
       -7.06708663e-01,  8.61579798e-01, -6.16385913e-01, -1.68976272e+00,
        2.20533348e-01,  7.19579329e-01,  3.58977909e-01, -1.45970882e-01,
       -3.15284265e-03, -7.46322538e-01,  7.27949231e-01,  1.94407808e+00,
       -1.81251115e+00, -8.68431127e-02,  4.31551662e-01, -1.70699833e-01,
       -1.92489330e-01,  5.12136509e-01, -5.84408707e-01,  3.27633494e-01,
       -7.97410517e-01,  3.87768999e-01, -2.54024770e-01, -4.34470291e-01,
       -8.42417605e-01,  3.59663882e-01,  7.04188949e-02, -4.06277547e-01,
       -3.65616413e-01,  1.75615417e+00,  1.57804594e+00,  6.29505189e-01,
       -1.49082516e-01,  1.27396007e+00,  7.42563330e-01, -4.20681655e-01,
       -1.17253782e-01, -9.06343822e-01, -4.21793183e-01,  5.97464626e-01,
        9.37764459e-01,  4.21968281e-01, -7.24286816e-01, -2.35467377e+00,
       -1.41354339e+00, -7.38239155e-01,  4.53978524e-01,  1.02235297e+00,
        1.70648960e+00, -3.21136812e-01,  5.34004653e-01, -3.24348697e-01,
       -1.16075871e+00,  3.75504961e-01,  1.92005079e-01,  2.42659416e-01,
       -1.96947187e+00,  2.11485099e-01,  9.52865033e-01, -1.16120292e+00,
        9.06466317e-01, -5.34506005e-01, -1.11915322e+00,  7.50976025e-01,
       -6.55659625e-01,  5.21194159e-01,  6.26034562e-01,  6.59991829e-01,
       -3.32561320e-01, -3.77057060e-01, -4.92427635e-01,  7.26040188e-01,
       -3.69913012e-01,  2.40136969e-01,  1.63028111e+00,  6.02197731e-01,
       -1.43005821e-01, -4.89191728e-01, -4.37500696e-01, -7.36816507e-01,
       -2.99238142e+00,  4.27622187e-01,  4.51664463e-01, -2.83233592e-02,
        1.64755212e-01,  1.14790252e-01,  6.35562416e-01, -6.14905291e-02,
       -4.85183861e-01,  4.68621876e-02,  1.65483599e+00,  4.07505771e-01,
        1.82267166e+00, -1.21444379e+00,  1.24810443e-01, -9.33837656e-01,
       -3.43653488e-01, -9.33176114e-01,  1.10234958e-01, -7.12810382e-01,
       -1.09199701e+00,  1.46257071e+00,  1.52955695e+00,  6.93336952e-02,
        7.82878769e-01,  1.98690094e+00, -9.49324070e-01,  7.00496689e-01,
        7.84968829e-01, -1.04843144e-01,  2.49754005e+00,  7.41987309e-01,
        1.26044078e+00,  9.58473750e-01, -1.39345309e+00, -4.47456966e-01,
        1.27798970e+00,  1.11041108e+00, -1.01912257e-01,  5.64042170e-01,
        5.35371756e-01, -9.07001492e-01, -1.75044493e+00,  1.06365600e+00,
       -4.11972162e-02, -6.26836748e-01,  1.90118687e+00, -7.76992315e-01,
       -2.76855877e-01,  3.67747823e-01,  1.69589061e+00,  7.02076103e-01,
        1.55869680e-02,  1.70756061e+00, -1.11307171e+00,  9.88207113e-01,
       -9.02688455e-01, -1.76880692e-01, -1.00007937e+00, -1.22808329e+00,
        3.39042847e+00,  9.94381216e-02,  1.56252803e-01,  1.73386147e+00,
       -2.40998662e-01, -7.29709638e-02,  6.64453637e-01, -4.94430622e-01,
       -6.25851061e-02, -9.20651099e-01, -2.45090687e+00,  7.60223039e-01,
        1.04200620e+00,  7.57162479e-02,  3.55549645e-01, -8.56705844e-01,
       -1.62836590e-01, -1.80390341e+00,  1.02499108e+00,  3.86928168e-01,
       -1.05944215e+00,  1.20735845e+00,  5.03885743e-02, -4.55241343e-01])

In [128]:
cats = pd.qcut(data, 4)
cats

[(0.725, 3.501], (-3.7239999999999998, -0.656], (-0.656, 0.0464], (-0.656, 0.0464], (0.0464, 0.725], ..., (0.0464, 0.725], (-3.7239999999999998, -0.656], (0.725, 3.501], (0.0464, 0.725], (-0.656, 0.0464]]
Length: 1000
Categories (4, interval[float64]): [(-3.7239999999999998, -0.656] < (-0.656, 0.0464] < (0.0464, 0.725] < (0.725, 3.501]]

In [129]:
pd.value_counts(cats)

(0.725, 3.501]                   250
(0.0464, 0.725]                  250
(-0.656, 0.0464]                 250
(-3.7239999999999998, -0.656]    250
dtype: int64

In [131]:
pd.value_counts(pd.qcut(data, [0,0.1,0.5,0.9,1.]))

(0.0464, 1.279]                  400
(-1.225, 0.0464]                 400
(1.279, 3.501]                   100
(-3.7239999999999998, -1.225]    100
dtype: int64

检测和过滤异常值

In [132]:
data = pd.DataFrame(np.random.randn(1000,4))

In [133]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024962     0.012394     0.046132     0.008041
std       1.020664     0.986588     0.961863     0.949359
min      -3.012871    -3.180287    -3.199578    -3.095061
25%      -0.692735    -0.633823    -0.613701    -0.617661
50%       0.024816     0.001936     0.053748    -0.010888
75%       0.706545     0.660018     0.691076     0.646555
max       3.200118     2.934561     2.860127     2.969272

In [140]:
col = data[2]

In [143]:
col[np.abs(col) >3]

682   -3.199578
Name: 2, dtype: float64

In [149]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
80   3.200118  1.018130 -0.474624  0.482255
119 -3.012871 -1.369545 -0.995785  0.923714
232  0.113410 -0.208054  0.860085 -3.088756
682 -0.932894 -1.317667 -3.199578  2.558129
903 -1.753204  0.032253  0.956935 -3.095061
915 -0.812552 -3.180287 -1.182845 -1.486231

In [150]:
data[np.abs(data)>3] = np.sign(data)*3

In [152]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024774     0.012574     0.046332     0.008225
std       1.020022     0.986020     0.961209     0.948767
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.692735    -0.633823    -0.613701    -0.617661
50%       0.024816     0.001936     0.053748    -0.010888
75%       0.706545     0.660018     0.691076     0.646555
max       3.000000     2.934561     2.860127     2.969272

In [154]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0  1.0  1.0 -1.0
4  1.0  1.0  1.0 -1.0

排列和随机采样

In [155]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [156]:
sampler = np.random.permutation(5)

In [157]:
sampler

array([0, 3, 1, 4, 2])

In [159]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11

In [160]:
df.sample(n = 3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [161]:
choices = pd.Series([5,7,-1,6,4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [162]:
draws = choices.sample(n =10, replace = True)

In [163]:
draws

3    6
2   -1
0    5
1    7
2   -1
3    6
3    6
4    4
0    5
3    6
dtype: int64

计算指标/哑变量

In [164]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'], 'data1':range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [165]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [166]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [168]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [169]:
mnames = ['movie_id', 'title', 'genres']

In [178]:
movies = pd.read_table('movies.dat', sep='::', header=None, names=mnames)

D:\Users\T470\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [182]:
movies.head(10)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [186]:
all_genres = []
for i in movies.genres:
    all_genres.extend(i.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [187]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [188]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [189]:
gen = movies.genres[0]

In [190]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [191]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [193]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [194]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [195]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [196]:
np.random.seed(12345)

In [197]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [198]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [199]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

字符串操作

In [200]:
val = 'a,b,guido'
val

'a,b,guido'

In [202]:
val.split(',')

['a', 'b', 'guido']

In [203]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [204]:
first, second, third = pieces

In [205]:
first + '::' + second + '::' + third

'a::b::guido'

In [207]:
'|'.join(pieces)

'a|b|guido'

In [208]:
'guido' in val

True

In [213]:
val.index(',')

1

In [217]:
val.find(':')#-1代表异常

-1

In [218]:
val.index(':')

ValueError: substring not found

In [220]:
val.count(',')

2

In [221]:
val.replace(',','')

'abguido'

正则表达式

In [223]:
import re

In [225]:
text = 'foo bar\t baz \tqux'
text

'foo bar\t baz \tqux'

In [226]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [228]:
regex = re.compile('\s+')

In [229]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [230]:
regex.findall(text)

[' ', '\t ', ' \t']

pandas的矢量化字符串函数

In [231]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [232]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [233]:
data = pd.Series(data)

In [234]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [235]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [236]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [240]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [241]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [242]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [243]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [244]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [245]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [246]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [247]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object